// масив набір елментів, в масиві може бути будь який елмент, будь якого типу наприклад null, symbol, undefined, object і тд
// let arr = [1,2,3]



// перевірка на масив
// console.log(Array.isArray(arr))

// // вивели 2
// console.log(arr[1])

// // додати елемент в масив
// arr.push('element','211')

// arr.push(...items) – добавляет элементы в конец,
// arr.pop() – извлекает элемент из конца,
// arr.shift() – извлекает элемент из начала,
// arr.unshift(...items) – добавляет элементы в начало.

// погратися з push
// pop
// shift
// unshift

// 3 пербрати масив в файлику (там написано) плюс зробити
// масив в якому буде два масива які 
// будуть мати в собі два любих елементи, 
//вивести в консоль елементи цих двох масивів по черзі через фор(цик в циклі)
// 4 cycles


// const arr = [1, 2, 3,]

// let i = 0
// for (i; i < 3; i++) {
//     console.log(arr[i])
// }

// const array = [
//     [1, 2],
//     ['name', 'age']
// ]

// for (let l = 0; l < 2; l++) {
//     for (let k = 0; k < 2; k++) {
//         console.log(array[l][k]) 
//     }
// }