/*
писати розвязки в окремому файлі dz.js та коментити по понутках задачки, всього 5 коментів бо 5 пунктів
1 погратися з typeof
2 дописати функції плюс написати функцію для 
  качків -  Калькулятор максимального веса жима лежа тут дивись приклад https://wpcalc.com/zhim-lezha/
функція приймає на вхід вагу штанги і кількість повторів(тобто скільки ти разів зможеш пожати цю вагу) а повертає разовий максимум
3 пербрати масив в файлику (там написано) плюс зробити масив в якому буде два масива які 
будуть мати в собі два любих елементи, вивести в консоль елементи цих двох масивів по черзі через фор(цик в циклі)
4 cycles
5 зробити обєкт кввіта який буде мати якісь ключі та значення, вивести в консоль його ключі та значення як я показував
6 зробити строку 'person alina' де alina це зімнна name (використовувати конткатенацію)
  розбити цю строку на масив та поміняти alina на назар 
  потім через джоін вернути масив  в строку
  */

// 1 done

// 3

// 4

// 2

// 5

// 6